In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({'Stud': ['Ivan', 'Petr', 'Maria'],
                   'Subject': ['Math', 'Hist', "Georgr"],
                   'Grade': [35, 75, 90]})
df

    Stud Subject  Grade
0   Ivan    Math     35
1   Petr    Hist     75
2  Maria  Georgr     90

In [6]:
df['EurGrade'] = ['F', 'C', 'A']
# df['EurGrade'] = df['Grade'].apply(<название функции>)
df

    Stud Subject  Grade EurGrade
0   Ivan    Math     35        F
1   Petr    Hist     75        C
2  Maria  Georgr     90        A

In [7]:
def density(row):
    return row['rate'] / row['present']

In [8]:
data = pd.DataFrame({'stud_id': [1, 2, 3],
                    'rate': [97, 83, 75],
                    'present': [2, 4, 1]})
data

   stud_id  rate  present
0        1    97        2
1        2    83        4
2        3    75        1

In [10]:
data['density'] = data.apply(density, axis=1)
data

   stud_id  rate  present  density
0        1    97        2    48.50
1        2    83        4    20.75
2        3    75        1    75.00

In [12]:
data['division by 5'] = data.density.apply(lambda x: x / 5)
# data['division by 5'] = data['density'].apply(lambda x: x / 5)
data

   stud_id  rate  present  density  division by 5
0        1    97        2    48.50           9.70
1        2    83        4    20.75           4.15
2        3    75        1    75.00          15.00

# Группировки

In [15]:
marks = pd.DataFrame({'stud_id': [1, 2, 3, 4, 5],
                     'subject': ['ТВиМС', 'Матан', 'ТВиМС', 'Матан', 'ТВиМС'],
                     'amount': [100, 80, 90, 140, 90]})
marks

   stud_id subject  amount
0        1   ТВиМС     100
1        2   Матан      80
2        3   ТВиМС      90
3        4   Матан     140
4        5   ТВиМС      90

In [16]:
tvims = marks[marks.subject == 'ТВиМС']
tvims

   stud_id subject  amount
0        1   ТВиМС     100
2        3   ТВиМС      90
4        5   ТВиМС      90

In [18]:
matan = marks[marks['subject'] == 'Матан']
matan

   stud_id subject  amount
1        2   Матан      80
3        4   Матан     140

In [20]:
tvims['amount'].mean()  # среднее значение

93.33333333333333

In [21]:
marks['amount'].max() - marks['amount'].min()

60

In [25]:
def group_by(data):
    return data.amount.max() - data.amount.min()

In [26]:
marks.groupby('subject').apply(group_by)

subject
Матан    60
ТВиМС    10
dtype: int64